In [65]:
import pandas as pd

df = pd.read_csv("dirty_dataset.csv", encoding='latin-1')
#Primer cambio a latin por problema de:
#UnicodeDecodeError: 'utf-8' codec can't decode byte 0xe9 in position 1863: invalid continuation byte

In [66]:
df.head(15)
#Segundo erro el nombre de la columna

,Column_1,Platform,Year,gerne,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,$ 8.46,82.74
1,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,$ 0.77,40.24
2,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,$ 3.31,35.82
3,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,$ 2.96,33.00
4,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,$ 1.00,31.37
5,Tetris,GB,1989.0,Puzzle,Nintendo,23.20,2.26,4.22,$ 0.58,30.26
6,New Super Mario Bros.,DS,2006.0,Platform,Nintendo,11.38,9.23,6.50,$ 2.90,30.01
7,Wii Play,Wii,2006.0,Misc,Nintendo,14.03,9.20,2.93,$ 2.85,29.02
8,New Super Mario Bros. Wii,Wii,2009.0,Platform,Nintendo,14.59,7.06,4.70,$ 2.26,28.62
9,Duck Hunt,NES,1984.0,Shooter,Nintendo,26.93,0.63,0.28,$ 0.47,28.31
10,Nintendogs,DS,2005.0,Simulation,Nintendo,9.07,11.00,1.93,$ 2.75,24.76
11,Mario Kart DS,DS,2005.0,Racing,Nintendo,9.81,7.57,4.13,$ 1.92,23.42
12,Pokemon Gold/Pokemon Silver,GB,1999.0,Role-Playing,Nintendo,9.00,6.18,7.20,$ 0.71,23.10
13,Wii Fit,Wii,2007.0,Sports,Nintendo,8.94,8.03,3.60,$ 2.15,22.72
14,Wii Fit Plus,Wii,2009.0,Sports,Nintendo,9.09,8.59,2.53,$ 1.79,22.00

In [67]:
df = df.rename(columns={'Column_1': 'Name'})
df = df.rename(columns={'gerne': 'Genre'})

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6170 entries, 0 to 6169
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          6170 non-null   object
 1   Platform      6170 non-null   object
 2   Year          6160 non-null   float64
 3   Genre         6170 non-null   object
 4   Publisher     6096 non-null   object
 5   NA_Sales      6170 non-null   float64
 6   EU_Sales      6170 non-null   float64
 7   JP_Sales      6170 non-null   float64
 8   Other_Sales   6170 non-null   object
 9   Global_Sales  6170 non-null   float64
dtypes: float64(5), object(5)
memory usage: 482.2+ KB

In [69]:
df.Year.isna().any()
#Hay falsos

True

In [70]:
print(df[df.Year.isna()])

                                                   Name Platform  Year  \
410                                         Final Fight     SNES   NaN
1483                      Discovery Kids: Kitten Corner       DS   NaN
1745             The Legend of Spyro: The Eternal Night       DS   NaN
1755  Fushigi no Dungeon: Furai no Shiren 2 - Oni Sh...      N64   NaN
1961                                The Incredible Hulk      Wii   NaN
3043           Doctor Lautrec and the Forgotten Knights      3DS   NaN
3333                              Rango: The Video Game      Wii   NaN
3739        Paws & Claws Pet Vet: Australian Adventures       DS   NaN
3846         Who Wants to Be a Millionaire: 3rd Edition      Wii   NaN
6019    Tantei Jinguuji Saburo DS: Fuserareta Shinjitsu       DS   NaN

             Genre                     Publisher  NA_Sales  EU_Sales  \
410         Action                        Capcom      0.67      0.17
1483    Simulation                     505 Games      0.42      0.00
1745      Platform                 Vivendi Games      0.32      0.03
1755  Role-Playing                      ChunSoft      0.00      0.00
1961        Action                          Sega      0.28      0.01
3043     Adventure  Konami Digital Entertainment      0.07      0.05
3333        Action               Electronic Arts      0.08      0.04
3739    Simulation                           THQ      0.10      0.00
3846          Misc                       Ubisoft      0.10      0.00
6019     Adventure              Arc System Works      0.00      0.00

      JP_Sales Other_Sales  Global_Sales
410       0.69      $ 0.03          1.56
1483      0.00      $ 0.03          0.45
1745      0.00      $ 0.03          0.37
1755      0.32      $ 0.05          0.37
1961      0.00      $ 0.02          0.31
3043      0.03      $ 0.01          0.16
3333      0.00      $ 0.01          0.14
3739      0.00      $ 0.01          0.11
3846      0.00      $ 0.01          0.10
6019      0.01      $ 0.00          0.01

In [71]:
df[df.Year.isna()] = 2000

In [72]:
df.Year.isna().any()
#Ya no hay vacios

False

In [73]:
df.head(9)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,$ 8.46,82.74
1,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,$ 0.77,40.24
2,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,$ 3.31,35.82
3,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,$ 2.96,33.00
4,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,$ 1.00,31.37
5,Tetris,GB,1989.0,Puzzle,Nintendo,23.20,2.26,4.22,$ 0.58,30.26
6,New Super Mario Bros.,DS,2006.0,Platform,Nintendo,11.38,9.23,6.50,$ 2.90,30.01
7,Wii Play,Wii,2006.0,Misc,Nintendo,14.03,9.20,2.93,$ 2.85,29.02
8,New Super Mario Bros. Wii,Wii,2009.0,Platform,Nintendo,14.59,7.06,4.70,$ 2.26,28.62

In [74]:
df.loc[5]

Name              Tetris
Platform              GB
Year              1989.0
Genre             Puzzle
Publisher       Nintendo
NA_Sales            23.2
EU_Sales            2.26
JP_Sales            4.22
Other_Sales       $ 0.58
Global_Sales       30.26
Name: 5, dtype: object

In [75]:
df.Name.duplicated().any()
# Tengo nombres duplicados

True

In [76]:
df.query("Name == 'Tetris'")
#Ya hay 2 errores el nombre repetido y el global sales
#El primero es que esta bien

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
5,Tetris,GB,1989.0,Puzzle,Nintendo,23.20,2.26,4.22,$ 0.58,30.26
72,Tetris,NES,1988.0,Puzzle,Nintendo,2.97,0.69,1.81,$ 0.11,5.58
5242,Tetris,GB,1989.0,Puzzle,Nintendo,23.20,2.26,4.22,$ 0.58,9999.99

In [77]:
# Usaremos la moda para reemplzar
moda_nombre = df['Name'].mode()[0]
print(df["Name"].dtype)

object

In [78]:
moda_nombre = df['Name'].mode()[0]
moda_nombre

2000

In [79]:
df.query("Name == 2000")
# Parece que la palabra mas repetida es 2000 para aplicar esto como moda. Para reemplzar el nombre

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
410,2000,2000,2000.0,2000,2000,2000.0,2000.0,2000.0,2000,2000.0
1483,2000,2000,2000.0,2000,2000,2000.0,2000.0,2000.0,2000,2000.0
1745,2000,2000,2000.0,2000,2000,2000.0,2000.0,2000.0,2000,2000.0
1755,2000,2000,2000.0,2000,2000,2000.0,2000.0,2000.0,2000,2000.0
1961,2000,2000,2000.0,2000,2000,2000.0,2000.0,2000.0,2000,2000.0
3043,2000,2000,2000.0,2000,2000,2000.0,2000.0,2000.0,2000,2000.0
3333,2000,2000,2000.0,2000,2000,2000.0,2000.0,2000.0,2000,2000.0
3739,2000,2000,2000.0,2000,2000,2000.0,2000.0,2000.0,2000,2000.0
3846,2000,2000,2000.0,2000,2000,2000.0,2000.0,2000.0,2000,2000.0
6019,2000,2000,2000.0,2000,2000,2000.0,2000.0,2000.0,2000,2000.0

In [80]:
# Se define la condicion de las filas 
condicion = df['Name'] == 'Tetris'
# podemos usar iloc para seleccionar las filas que cumplen la condicon:
df.loc[condicion, 'Name'] = moda_nombre

In [81]:
#Buscamos la mediana, para reemplazar la que tiene 9999.99 en globales sales.

mediana= df["Global_Sales"].median()
mediana

0.16

In [82]:
# Aplico la misma condicion que antes

condicion2= df["Global_Sales"] == 9999.99

df.loc[condicion, 'Global_Sales'] = mediana

In [83]:
df.head(6)
# Veo que Other Sales tiene el dolar ahora me doy cuenta, es toda la columna

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,$ 8.46,82.74
1,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,$ 0.77,40.24
2,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,$ 3.31,35.82
3,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,$ 2.96,33.00
4,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,$ 1.00,31.37
5,2000,GB,1989.0,Puzzle,Nintendo,23.20,2.26,4.22,$ 0.58,0.16

In [84]:
df['Other_Sales'] = df['Other_Sales'].str.replace('$ ', '', regex=False)

df['Other_Sales'] = df['Other_Sales'].astype(float)

In [85]:
df.Other_Sales
#Cambiado

0       8.46
1       0.77
2       3.31
3       2.96
4       1.00
        ...
6165    0.00
6166    0.00
6167    0.00
6168    0.00
6169    0.00
Name: Other_Sales, Length: 6170, dtype: float64

In [86]:
df.query("Publisher == 'N/A'")
#No hay nada cambiado

Empty DataFrame
Columns: [Name, Platform, Year, Genre, Publisher, NA_Sales, EU_Sales, JP_Sales, Other_Sales, Global_Sales]
Index: []

In [87]:
df.to_csv("clean_dataset.csv")